app/controllers/application_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "managers".* FROM "managers" WHERE "managers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def current_user
        if decoded_token
            decoded_id = decoded_token[0]['user_id']
            request.headers['role'] === "manager" ? Manager.find_by(id: decoded_id) : Employee.find_by(id:decoded_id)