app/controllers/employees_controller.rb

INSERT INTO "employees" ("manager_id", "name", "email", "password_digest", "created_at", "updated_at", "active") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        employee = Employee.new(employee_params)
        current_user.employees << employee

UPDATE "employees" SET "updated_at" = ?, "active" = ? WHERE "employees"."id" = ?  [["updated_at", "2023-02-10 19:43:30.319906"], ["active", 0], ["id", 8]]
---
    def update
        employee = find_employee
        employee.update!(employee_params)

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def find_employee
        Employee.find_by!(id: params[:id])