app/controllers/items_controller.rb

INSERT INTO "items" ("manager_id", "name_or_title", "img_url", "manufacturer_or_author", "price_per_item", "qty", "total_sold", "created_at", "updated_at", "active") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        item = Item.new(item_params)
        current_user.items << item

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "items" SET "price_per_item" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["price_per_item", 129], ["updated_at", "2023-02-10 17:24:58.210546"], ["id", 11]]
---
    def update
        item = Item.find(params[:id])
        item.update(item_params)

SELECT "items".* FROM "items" WHERE "items"."manager_id" = ? AND "items"."active" = ?  [["manager_id", 2], ["active", 1]]
SELECT "managers".* FROM "managers" WHERE "managers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def index
        user = current_user
        items = current_user.is_a?(Manager) ? current_user.items : current_user.manager.items.where(active: true)

DELETE FROM "items" WHERE "items"."id" = ?  [["id", 10]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def destroy
        if current_user.is_a?(Manager)
            Item.find(params[:id]).destroy