app/controllers/jwt_controller.rb

    def create
        user = manager_access? ?
            Manager.find_by(email: params[:email]) :
            Employee.where(email: params[:email], active: true)[0]
---
SELECT "managers".* FROM "managers" WHERE "managers"."email" = ? LIMIT ?  [["email", "dan@email.com"], ["LIMIT", 1]]
SELECT "employees".* FROM "employees" WHERE "employees"."email" = ? AND "employees"."active" = ?  [["email", "employer1@gmail.com"], ["active", 1]]