app/controllers/managers_controller.rb

    def create
        manager = Manager.create!(manager_params)
---
INSERT INTO "managers" ("name", "email", "password_digest", "bookshop_name", "bookshop_items_alert_limit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)