app/controllers/sales_transactions_controller.rb

    def create
        transaction = SalesTransaction.create(transaction_params)
        current_user.salesTransactions << transaction
        params[:items].map do |item|
            transaction.sales<< Sale.new(item_id: item[:id], item_price_at_sale: item[:price_per_item], qty:item[:total_sold])
            itemSold = Item.find_by(id: item[:id])
            itemSold.update(qty: itemSold.qty - item[:total_sold])
---
INSERT INTO "sales" ("sales_transaction_id", "item_id", "item_price_at_sale", "qty", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["sales_transaction_id", 9], ["item_id", 9], ["item_price_at_sale", 120], ["qty", 11], ["created_at", "2023-02-10 17:28:12.000731"], ["updated_at", "2023-02-10 17:28:12.000731"]]
INSERT INTO "sales_transactions" ("amount", "recieved", "change", "employee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["amount", 2520], ["recieved", 2520], ["change", 0], ["employee_id", 7], ["created_at", "2023-02-10 17:28:11.974441"], ["updated_at", "2023-02-10 17:28:11.974441"]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "items" SET "qty" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["qty", 0], ["updated_at", "2023-02-10 17:28:12.010362"], ["id", 9]]